/* <2025.05.04>
[ 두 집단의 비교, 두집단의 대응표본 ]
: 두 집단이 독립적이지 않음. 실험단위를 동질적인 쌍으로 묶은 다음 각 쌍을 임의로 추출하여 두 처리를 적용
쌍과 쌍끼리는 독립이고, 쌍내의 두 자룟값의 검정을 하기 위함임

예시 ) 다이어트 식품. -> 목적 : 몸무게립가설 :대졸이상인 집단과 그 외집단간에 SAT(만족도)에 차이가 있다. 
유의수준 : 0.05 
정규성 가정 검토 
등분산 가정 검토 
독립표본 t 검정결과 
 
 
/* 2025.05.04 
[ 두 집단의 비교, 두집단의 대응표본 ] 
: 두 집단이 독립적이지 않음. 실험단위를 동질적인 쌍으로 묶은 다음 각 쌍을 임의로 추출하여 두 처리를 적용 
쌍과 쌍끼리는 독립이고, 쌍내의 두 자룟값의 검정을 하기 위함임 (약간 before after같은 느낌!)
 
예시1 ) 다이어트 식품. -> 목적 : 몸무게 감소관련 => "단측검정"
H0 : 다이어트약의 효과가 없다.
H1 : 다이어트약의 효과가 있다.

약먹기 전 - 약먹은 후 = (-)여야 야함. (효과가 있음) => '우단측검정'
상식의 영향을 많이 받음. 

예시2 )예전 집단에서의 (iq1,iq2) => '좌단측검정' 
iq교육받기전 - 받은후 = (+)여야야함. (iq가 증가해야함)

H0 : ud=0 (ud=u1-u2=0)


proc ttest data=data name;
paired 변수면1+변수명2; (변수명1 : before, 변수명2 : after)
run;

*/

/* 
[실습 1]
H0 : ud = 0 ( 프로그램 전후로 아이큐의 변화가 없다. )
H1 : ud < 0 ( 프로그램 전후로 아이큐가 증가하였다. ) => '양측검정'

*/


data d;
input a 1 id 2-3 name$ 4-12 math 13-14 eng 15-16 iq1 17-19 iq2 20-22;
diff = iq1-iq2;
cards;
2 1강성혁8972127129
2 2정수진9088140145
2 3김수민7476120117
2 4정선미8078123125
2 5조영기8289116120
2 6강은주7775124128
2 7전지영9584137139
2 8정희숙8190127130
2 9강난희7581111121
210나석영9495145146
211유승진8972124126
212김윤정9188125128
213홍석철7975127130
214이순철8077125126
215김수진7283109117
;
run;

/* 
[ iq 프로그램의 효과 분석 ]
귀무 : 프로그램의 효과가 없다.
대립 : 프로그램의 효과가 있다.
유의수준 : 0.05

*/

proc ttest data=d;
	paired iq1*iq2;
run;

/* 표본이 30개 미만이므로, 정규성검정을 해야함. */

proc univariate normal plot;
	var diff;
run;

/* s-w 검정 만족 + 귀무가설을 기각하므로, 프로그램의 효과가 있다. */

proc ttest data=d h0=0;
var diff;
run;

/* 실습문제 6.2 */
/* 다이어트 식품 분석 
귀무 : 다이어트 식품의 효과가 없다.
대립 : 다이어트 식품의 효과가 있다.
유의수준 : 0.05

*/
data e;
input id before after;
diff=before-after;
cards;
1 50 48
2 45 45
3 55 50
4 60 60
5 63 60
6 48 50
7 50 49
8 70 60
9 56 55
10 44 48
;
proc print data=e;
run;

proc univariate data=e normal;
	var diff;
run;

proc ttest data=e;
	paired before*after;
run;

proc ttest data=e;
	var diff;
run;

/* 효과가 없음. */

